# Önemli Methodlar

In [2]:
import pandas as pd

In [3]:
s=pd.Series([1,2,3,4],index=["a","b","c","d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
s["a"]

1

Reinex methodu belirlediğimiz indexlere göre veriyi tekrar düzenler.

In [5]:
s2=s.reindex(["b","d","a","c","e"])
s2

b    2.0
d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

In [6]:
s3=pd.Series(["mavi","sari","mor"],index=[0,2,4])
s3

0    mavi
2    sari
4     mor
dtype: object

İndexlerde boş olan kısımları ffill ile doldurmak mümkündür.

In [7]:
s3.reindex(range(6),method="ffill")

0    mavi
1    mavi
2    sari
3    sari
4     mor
5     mor
dtype: object

# DATAFRAME YAPISI

In [8]:
import numpy as np

In [18]:
df= pd.DataFrame(np.arange(9).reshape(3,3),index=["a","c","d"],
                columns=["John","Derek","Pearl"])
df

   John  Derek  Pearl
a     0      1      2
c     3      4      5
d     6      7      8

In [19]:
df2=df.reindex(["d","c","b","a"])
df2

   John  Derek  Pearl
d   6.0    7.0    8.0
c   3.0    4.0    5.0
b   NaN    NaN    NaN
a   0.0    1.0    2.0

In [20]:
names=["John","Sally","Derek"]
df.reindex(columns=names)

   John  Sally  Derek
a     0    NaN      1
c     3    NaN      4
d     6    NaN      7

In [21]:
df.loc[["c","d","a"]]

   John  Derek  Pearl
c     3      4      5
d     6      7      8
a     0      1      2

In [23]:
s=pd.Series(np.arange(5.),index=["a","b","c","d","e"])
s

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

Drop methodu ile istenilen satırı silebiliriz.

In [25]:
new_s= s.drop("b")
new_s

a    0.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [27]:
s.drop(["c","d"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [29]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                 index=["John","Pearl","Love","Dennis"],
                 columns=list("ABCD"))
data

         A   B   C   D
John     0   1   2   3
Pearl    4   5   6   7
Love     8   9  10  11
Dennis  12  13  14  15

In [30]:
data.drop(["John","Love"])

         A   B   C   D
Pearl    4   5   6   7
Dennis  12  13  14  15

axis=1 parametresiyle bir sütunu kaldırabiliriz.

In [31]:
data.drop("A",axis=1)

         B   C   D
John     1   2   3
Pearl    5   6   7
Love     9  10  11
Dennis  13  14  15

axis=0 parametresiyle satırı kaldırabiliriz.

In [33]:
data.drop("John",axis=0)

         A   B   C   D
Pearl    4   5   6   7
Love     8   9  10  11
Dennis  12  13  14  15

Verinin ortalamasını almak istersek mean() methodunu kullanabiliriz.

In [35]:
data.mean()

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64

Mean methodunu içine axis=0 parametresini yazarsak sütunun ortalamasını alır.

In [37]:
data.mean(axis=0)

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64

Mean methodunu içine axis=0 parametresini yazarsak satırın ortalamasını alır.

In [39]:
data.mean(axis=1)

John       1.5
Pearl      5.5
Love       9.5
Dennis    13.5
dtype: float64

axis=0 ve axis=1 özelliğini axis=index ve axis=columns özelliğini kullanmak da mümkündür.

In [41]:
data.mean(axis="index")

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64

In [42]:
data.mean(axis="columns")

John       1.5
Pearl      5.5
Love       9.5
Dennis    13.5
dtype: float64